# DataFrame

Dataframe is a main object in pandas.<br>
It is used to represent data with rows and columns(tablular or excel spreedsheet like data)

# Creating a pandas DataFrame
A pandas DF will be created by loading the datasets from existing storage.
<br>
Storage can be SQl DataBase, Csv file and Excel file.

In [3]:
#creating empty dataframe
import pandas as pd
df = pd.DataFrame()
type(df)

pandas.core.frame.DataFrame

In [16]:
#create DataFrame from list
#example1
lst = [1,2,3,4,5]
df = pd.DataFrame(lst,columns =['Num'],index=[1,2,3,4,5])
print(df)

   Num
1    1
2    2
3    3
4    4
5    5

In [7]:
#creating dataframe from list of lists.
data = [['sunil',10],['anil',12],['nima',13]]
df = pd.DataFrame(data , columns=['Name','Age'])
print(df)

    Name  Age
0  sunil   10
1   anil   12
2   nima   13

In [8]:
#exmple
data = [['sunil',10],['anil',12],['nima',13]]
df = pd.DataFrame(data , columns=['Name','Age'], dtype = float)
print(df)

    Name   Age
0  sunil  10.0
1   anil  12.0
2   nima  13.0

C:\Users\sunil\AppData\Local\Temp\ipykernel_1544\1375784817.py:3: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df = pd.DataFrame(data , columns=['Name','Age'], dtype = float)

In [17]:
#constructing DataFrame from a dictionary.

d = {'col1': [1, 2], 
     'col2': [3, 4]}
df = pd.DataFrame(data=d,index=[1,2])
df

   col1  col2
1     1     3
2     2     4

In [12]:
#Constructing DataFrame from a dictionary including Series:

d = {'col1': [0, 1, 2, 3], 'col2': pd.Series([2, 3], index=[2, 3])}
df=pd.DataFrame(data=d, index=[0, 1, 2, 3])
df

   col1  col2
0     0   NaN
1     1   NaN
2     2   2.0
3     3   3.0

In [14]:
#Constructing DataFrame from numpy ndarray:
import numpy as np
df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
                 columns=['a', 'b', 'c'])
df2

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [19]:
#constructing data from list of tuples
df = [('sunil',22,'Bhaktpur'),
    ('anil',14,'kathmandu')]
df = pd.DataFrame(data=df,index=[1,2],columns=['Name','Age','District'])
df

    Name  Age   District
1  sunil   22   Bhaktpur
2   anil   14  kathmandu

In [21]:
#constructing data from list of dictionaries
wether = [ {'day':'Sunday', 'windspeed': 5 , 'wether':'sunny'},
       {'day':'Monday', 'windspeed': 6 , 'wether':'Rain'},
       {'day':' Tuesday', 'windspeed': 5 , 'wether':'Fog'}]
df = pd.DataFrame(data=wether)
df

        day  windspeed wether
0    Sunday          5  sunny
1    Monday          6   Rain
2   Tuesday          5    Fog